HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.80/WSPR-TX0.80.ino
  GPSSerial.begin(9600); //Init software serial port to communicate with the on-board GPS module
 
  bool i2c_found;

 //Read all the Factory data from EEPROM at position 400
  if (LoadFromEPROM(FactorySpace)) //Read all Factory data from EEPROM
  {

  }
  else  //No factory data was found in EEPROM, set some defaults
  {
    FactoryData.HW_Version = 1;  // Hardware version
    FactoryData.HW_Revision = 12; // Hardware revision
    FactoryData.RefFreq = 25000000;//Reference Oscillator frequency
    FactoryData.LP_A_BandNum = 99; //Low Pass filter A is Nothing
    FactoryData.LP_B_BandNum = 99; //Low Pass filter B is Nothing
    FactoryData.LP_C_BandNum = 99; //Low Pass filter C is Nothing
    FactoryData.LP_D_BandNum = 99; //Low Pass filter D is Nothing
    if (Product_Model == 1012)    //Desktop Model, set default LP as a MidPlus version
    {
      FactoryData.LP_A_BandNum = 2; //Low Pass filter A is 160m
      FactoryData.LP_B_BandNum = 3; //Low Pass filter B is 80m
      FactoryData.LP_C_BandNum = 4; //Low Pass filter C is 40m
      FactoryData.LP_D_BandNum = 6; //Low Pass filter D is 20m
    }
    Serial.println(F("{MIN} No factory data found !"));
    Serial.println(F("{MIN} You need to run factory setup to complete configuration, guessing on calibration values for now"));
  }

  if (LoadFromEPROM(UserSpace)) //Read all UserSpace data from EEPROM at position 0
  {
    CurrentMode = GadgetData.StartMode; 
    GadgetData.WSPRData.CallSign[6] = 0;//make sure Call sign is null terminated in case of incomplete data saved
    GadgetData.WSPRData.MaidenHead4[4] = 0; //make sure Maidenhead locator is null terminated in case of incomplete data saved
  }
  else //No user data was found in EEPROM, set some defaults
  {
    CurrentMode = SignalGen ;
    GadgetData.Name[0] = 'W'; GadgetData.Name[1] = 'S'; GadgetData.Name[2] = 'P'; GadgetData.Name[3] = 'R';
    GadgetData.Name[4] = ' '; GadgetData.Name[5] = 'T'; GadgetData.Name[6] = 'X'; GadgetData.Name[7] = 0;
    GadgetData.StartMode = Idle;
    GadgetData.WSPRData.CallSign[0] = 'A'; GadgetData.WSPRData.CallSign[1] = 'A'; GadgetData.WSPRData.CallSign[2] = '0';
    GadgetData.WSPRData.CallSign[3] = 'A'; GadgetData.WSPRData.CallSign[4] = 'A'; GadgetData.WSPRData.CallSign[5] = 'A';
    GadgetData.WSPRData.CallSign[6] = 0;
    GadgetData.WSPRData.LocatorOption  = GPS;
    GadgetData.WSPRData.MaidenHead4[0] = 'A'; GadgetData.WSPRData.MaidenHead4[1] = 'A';
    GadgetData.WSPRData.MaidenHead4[2] = '0'; GadgetData.WSPRData.MaidenHead4[3] = '0';
    GadgetData.WSPRData.MaidenHead4[4] = 0;//Null termination
    GadgetData.WSPRData.TXPowerdBm = 23;   //Set deafult power to 0.2W
    if (Product_Model == 1017) //The WSPR mini
    {
      GadgetData.WSPRData.TXPowerdBm = 13; // WSPR Mini has 20mW output power
    }
    if (Product_Model == 1028) //The WSPR Pico
    {
      GadgetData.WSPRData.TXPowerdBm = 13; // WSPR Pico has 20mW output power
    }
    for (int i = 0; i <= 16; i++)
    {
      GadgetData.TXOnBand [i] = false; //Disable TX on all bands.
    }
    GadgetData.TXOnBand [6] = true; //enable TX on 20m
    GadgetData.TXPause = 120;  //Number of minutes to pause after transmisson
    GadgetData.GeneratorFreq = 2000000000;
    Serial.println(F("{MIN} No user data was found, setting default values"));
  }
  //Set staus LEd to  pin 4. This is the case for most hardware versions but some model use a different pinout and vill owerride this value below 
  StatusLED = 4;
  switch (Product_Model) {
    case 1011:
      Serial.println(F("{MIN} ZachTek WSPR-TX_LP1 transmitter"));
      break;

    case 1012:
      Serial.println(F("{MIN} ZachTek WSPR Desktop transmitter"));
      if ((FactoryData.HW_Version == 1) & (FactoryData.HW_Revision == 4)) // Early WSPR Desktop hardware had different Relay driving electronics
      {
        //De-energize all relays
        pinMode(Relay1, INPUT);
        pinMode(Relay2, INPUT);
        pinMode(Relay3, INPUT);
      }
      else
      {
        //De-energize all relays
        pinMode(Relay1, OUTPUT);
        pinMode(Relay2, OUTPUT);
        pinMode(Relay3, OUTPUT);
        digitalWrite(Relay1, LOW);
        digitalWrite(Relay2, LOW);
        digitalWrite(Relay3, LOW);
      }      
      break;

    case 1017:
      Serial.println(F("{MIN} ZachTek WSPR Mini transmitter"));
      StatusLED = A2; //Status LED uses a different output on the Mini
      pinMode(SiPower, OUTPUT);
      digitalWrite(SiPower, LOW);  //Turn on power to the Si5351
      break;

    case 1020:
      Serial.println(F("{MIN} ZachTek WSPR-TX_LP1 transmitter with Mezzanine LP4 board"));
      //De-energize all relays
      pinMode(Relay1, OUTPUT);
      pinMode(Relay2, OUTPUT);
      pinMode(Relay3, OUTPUT);
      digitalWrite(Relay1, LOW);
      digitalWrite(Relay2, LOW);
      digitalWrite(Relay3, LOW);
      break;

    case 1028:
      Serial.println(F("{MIN} ZachTek WSPR Pico transmitter"));
      StatusLED = A2; //Status LED uses a different output on the Pico
      //pinMode(SiPower, OUTPUT);
      //digitalWrite(SiPower, LOW);    //Turn on power to the Si5351
      // pinMode(GPSPower, OUTPUT);
      //digitalWrite(GPSPower, HIGH);  //Turn on the GPS
      CurrentMode = WSPRBeacon ; // Always boot the WSPR Pico in to beacon mode as a failsafe
      break;
  }
  
  // Use the Red LED as a Transmitt indicator and the Yellow LED as Status indicator
  pinMode(StatusLED, OUTPUT);
  pinMode(TransmitLED, OUTPUT);

  Serial.print(F("{MIN} Firmware version "));
  if (SoftwareVersion == 0) {
    Serial.print(F("Beta "));
  }
  Serial.print(SoftwareVersion);
  Serial.print(("."));
  Serial.println(SoftwareRevision);

    
  //Blink StatusLED to indicate Reboot
  LEDBlink(16);
  random(RandomSeed());
  PowerSaveOFF();


  switch (CurrentMode) {
    case SignalGen :
      DoSignalGen();
      break;

    case WSPRBeacon:
      CurrentBand = 0;
      DoWSPR();
      break;

    case Idle:
      DoIdle();
      break;
  }
}




void loop()
{
  if (Serial.available()) {  //Handle  Serial API request from the PC
    DoSerialHandling();
  }
  while (gps.available( GPSSerial )) { //Handle Serial data from the GPS as they arrive
    fix = gps.read();
    SendAPIUpdate(UMesTime);

