HarrydeBug/WSPR-transmitters/Standard Firmware/Release/Hardware_Version_1_ATMega328/WSPR-TX0.80/WSPR-TX0.80.ino
          }
          Serial.print (F("{FLP} A "));
          if (FactoryData.LP_A_BandNum < 10) Serial.print (("0"));
          Serial.println (FactoryData.LP_A_BandNum);
          Serial.print (F("{FLP} B "));
          if (FactoryData.LP_B_BandNum < 10) Serial.print (("0"));
          Serial.println (FactoryData.LP_B_BandNum);
          Serial.print (F("{FLP} C "));
          if (FactoryData.LP_C_BandNum < 10) Serial.print (("0"));
          Serial.println (FactoryData.LP_C_BandNum);
          Serial.print (F("{FLP} D "));
          if (FactoryData.LP_D_BandNum < 10) Serial.print (("0"));
          Serial.println (FactoryData.LP_D_BandNum);
        }
      }//Low pass filter config

      //Reference Oscillator Frequency
      if ((InputCMD[2] == 'R') && (InputCMD[3] == 'F')) {
        if (InputCMD[6] == 'S') { //Set option
          for (int i = 0; i <= 8; i++) {
            CharInt[i] = InputCMD[i + 8];
          }
          CharInt[9] = 0;
          FactoryData.RefFreq = StrTouint64_t(CharInt);
        }
        else //Get
        {
          Serial.print (F("{FRF} "));
          Serial.println (uint64ToStr(FactoryData.RefFreq, true));
        }
      }//Reference Oscillator Frequency

      //Store Current Factory configuration data to EEPROM
      if ((InputCMD[2] == 'S') && (InputCMD[3] == 'E')) {
        if (InputCMD[6] == 'S') { //Set option
          SaveToEEPROM(FactorySpace);
          Serial.println(F("{MIN} Factory data saved"));
        }
      }

      exit;
    }//Factory
  }
}


uint64_t  StrTouint64_t (String InString)
{
  uint64_t y = 0;

  for (int i = 0; i < InString.length(); i++) {
    char c = InString.charAt(i);
    if (c < '0' || c > '9') break;
    y *= 10;
    y += (c - '0');
  }
  return y;
}

String  uint64ToStr (uint64_t p_InNumber, boolean p_LeadingZeros)
{
  char l_HighBuffer[7]; //6 digits + null terminator char
  char l_LowBuffer[7]; //6 digits + null terminator char
  char l_ResultBuffer [13]; //12 digits + null terminator char
  String l_ResultString = "";
  uint8_t l_Digit;

  sprintf(l_HighBuffer, "%06lu", p_InNumber / 1000000L); //Convert high part of 64bit unsigned integer to char array
  sprintf(l_LowBuffer, "%06lu", p_InNumber % 1000000L); //Convert low part of 64bit unsigned integer to char array
  l_ResultString = l_HighBuffer;
  l_ResultString = l_ResultString + l_LowBuffer; //Copy the 2 part result to a string

  if (!p_LeadingZeros) //If leading zeros should be removed
  {
    l_ResultString.toCharArray(l_ResultBuffer, 13);
    for (l_Digit = 0; l_Digit < 12; l_Digit++ )
    {
      if (l_ResultBuffer[l_Digit] == '0')
      {
        l_ResultBuffer[l_Digit] = ' '; // replace zero with a space character
      }
      else
      {
        break; //We have found all the leading Zeros, exit loop
      }
    }
    l_ResultString = l_ResultBuffer;
    l_ResultString.trim();//Remove all leading spaces
  }
  return l_ResultString;
}


void DoSignalGen ()
{
  CurrentMode = SignalGen;
  freq = GadgetData.GeneratorFreq;
  PickLP(FreqToBand()); //USe the correct low pass filter
  si5351aSetFrequency(freq);
  digitalWrite(StatusLED, HIGH);
  SendAPIUpdate (UMesCurrentMode);
  SendAPIUpdate (UMesFreq);
}


void DoIdle ()
{
  PowerSaveOFF();
  CurrentMode = Idle;
  digitalWrite(StatusLED, LOW);
  si5351aOutputOff(SI_CLK0_CONTROL);
  SendAPIUpdate (UMesCurrentMode);
}


void DoWSPR ()
{
boolean ConfigError;

  PowerSaveOFF();  //Make sure GPS is not in sleep mode
  CurrentMode = WSPRBeacon;
  ConfigError=false;
  
  //Make sure at least one band is enabled for tranmission
  if (NoBandEnabled ()) 
  {
    Serial.println (F("{MIN}Tranmission is not enebled on any band"));
    ConfigError=true;
  }  

  //Make sure  call sign is set
  if ((GadgetData.WSPRData.CallSign[0] == 'A') && (GadgetData.WSPRData.CallSign[1] == 'A') && (GadgetData.WSPRData.CallSign[2] == '0') && (GadgetData.WSPRData.CallSign[3] == 'A') && (GadgetData.WSPRData.CallSign[4] == 'A') && (GadgetData.WSPRData.CallSign[5] == 'A')) //Do not actually key the transmitter if the callsign has not been changed from the default one AA0AAA
  {
    Serial.println(F("{MIN}Call Sign not set"));
    ConfigError=true;
  }

   if (ConfigError)
   {
    Serial.println (F("{MIN}Can not start WSPR Beacon"));
     DoIdle();// Go back to ideling
   }
  else
  {
    NextFreq(); //Cycle to next enabled band to transmitt on 
    freq = freq + (100ULL * random (-100, 100)); //modify TX frequency with a random value beween -100 and +100 Hz
    si5351aOutputOff(SI_CLK0_CONTROL);
    SendAPIUpdate (UMesCurrentMode);

    //LOOP HERE FOREVER OR UNTIL INTERRUPTED BY A SERIAL COMMAND
    while (!Serial.available()) { //Do until incoming serial command
      while (gps.available( GPSSerial )) { //If GPS data available - process it
        fix = gps.read();
        if (Serial.available()) {// If serialdata was received on control port then handle command
          DoIdle(); //Return to ideling
          return;
        }
        if (fix.valid.location && fix.valid.time)
        {
          GPSH = fix.dateTime.hours;
          GPSM = fix.dateTime.minutes;
          GPSS = fix.dateTime.seconds;
          if (GadgetData.WSPRData.LocatorOption == GPS) { //If GPS should update the Maidenhead locator
            //calcLocator (Lat, Lon);
            calcLocator (fix.latitude(), fix.longitude());
          }

          if ((GPSS == 0) && ((GPSM % 2) == 0))//If second is zero at even minute then start WSPR transmission
          {
            set_tx_buffer();// Encode the message in the transmit buffer
            GPSGoToSleep();//Put GPS to sleep to save power
            if (SendWSPRBlock () != 0) //Send a WSPR "Packet" for 1 minute and 50 seconds
            {
              // there was an serial command that interrupted the WSPR Block so go and handle it
              //DoIdle(); //Abort and start ideling, in the idle loop all Serial commands will be properly handled.
              return;
            }
            if (LastFreq ())  //If all bands have been transmitted on then pause for user defined time and after that start over on the first band again
            {
              if ((GadgetData.TXPause > 60) && (Product_Model == 1017 )) //More than a 60 sec. of TX delay then do power saving (Mini model only)
              {
                delay (600); //Let the serial port send data from its buffer before we go to sleep
                Si5351PowerOff ();//Turn off the PLL to save power
                MCUGoToSleep (GadgetData.TXPause - 30);               //Set MCU in sleep mode until there is 30 seconds left of delay
                PowerSaveOFF();// Turn on GPS and PLL again
                smartdelay(2000); // let the smartdelay routine read a few GPS lines so we can get the new GPS time after our sleep
              }
              else
              { //Not a long pause and not a Mini so do a regular pause after the tranmission for the legth of time the user has specified in the GUI
                smartdelay(GadgetData.TXPause * 1000UL); //Pause for the time set by the user
              }
            }
            GPSWakeUp();
            NextFreq();// get the frequency for the next HAM band that we will transmit on
            freq = freq + (100ULL * random (-100, 100)); //modify the TX frequency with a random value beween -100 and +100 Hz to avoid lengthy colisions with other users on the band
            smartdelay(3000);
          }
          else //We have GPS fix but it is not top of even minute so dubble-blink to indicate waiting for top of minute
          {
            SendAPIUpdate(UMesTime);
            if (GPSS < 57) //Send some nice-to-have info only if the WSPR start is at least 3 seconds away
            {
              SendAPIUpdate(UMesGPSLock);
              SendAPIUpdate(UMesLocator);
              SendSatData(); //Send Satellite postion and SNR information to the PC GUI
            }
            LEDBlink(2);
            smartdelay(200);
          }
        }
        else
        { //Waitng for GPS location fix
          SendSatData(); //Send Satellite postion and SNR information to the PC GUI, while we wait for the GPS location fix
          LEDBlink(1); //singelblink to indicate waiting for GPS Lock
          SendAPIUpdate(UMesNoGPSLock); //Send No lock status
          //GPSH = fix.dateTime.hours;
          //GPSM = fix.dateTime.minutes;
          //GPSS = fix.dateTime.seconds;
          SendAPIUpdate(UMesTime);    //Send GPS time
          smartdelay(400);
        }
      } //GPS serial data loop
    } //Incoming serial command
  }
}


// Transmitt a Type 1 message for 1 minute 50 seconds on frequency freq
int SendWSPRBlock()
{
  uint8_t i;
  unsigned long startmillis;
  unsigned long endmillis;
  boolean TXEnabled = true;
  int errcode;
  errcode = 0;
  boolean blinked;
    // Send WSPR for two minutes
    digitalWrite(StatusLED, HIGH);
    startmillis = millis();
    for (i = 0; i < 162; i++)  //162 WSPR symbols to transmitt
    {
      blinked = false;
      endmillis = startmillis + ((i + 1) * (unsigned long) 683) ;   // intersymbol delay in WSPR is 683 milliseconds
      uint64_t tonefreq;
      tonefreq = freq + ((tx_buffer[i] * 146));  //~1.46 Hz  Tone spacing in centiHz
      if (TXEnabled) si5351aSetFrequency(tonefreq);
      //wait untill tone is transmitted for the correct amount of time
      while ((millis() < endmillis) && (!Serial.available())) ;//Until time is up or there is serial data received on the control Serial port
      {
        if (!blinked)   {  //do pulsing blinks on Status LED to indicate WSPR Beacon transmission 
          for (int i = 0; i < 5; i++)
          {
            digitalWrite(StatusLED, HIGH);
            delay (10);
            digitalWrite(StatusLED, LOW);
            delay (50);
          }
          blinked = true;
        }
      }
      if (Serial.available()) // If serialdata was received on Controll port then abort and handle command
      {
        errcode = 1;
        break;
      }
    }
 
  // Switches off Si5351a output
  si5351aOutputOff(SI_CLK0_CONTROL);
  digitalWrite(StatusLED, LOW);
  return errcode;
}

void set_tx_buffer()
{
  // Clear out the transmit buffer
  memset(tx_buffer, 0, sizeof(tx_buffer));
  jtencode.wspr_encode(GadgetData.WSPRData.CallSign, GadgetData.WSPRData.MaidenHead4, GadgetData.WSPRData.TXPowerdBm, tx_buffer);
}


//Maidenhead code from Ossi Väänänen https://ham.stackexchange.com/questions/221/how-can-one-convert-from-lat-long-to-grid-square
void calcLocator(double lat, double lon) {
  int o1, o2, o3;
  int a1, a2, a3;
  double remainder;
  // longitude
  remainder = lon + 180.0;
  o1 = (int)(remainder / 20.0);
  remainder = remainder - (double)o1 * 20.0;
  o2 = (int)(remainder / 2.0);
  //remainder = remainder - 2.0 * (double)o2;
  //o3 = (int)(12.0 * remainder);

  // latitude
  remainder = lat + 90.0;
  a1 = (int)(remainder / 10.0);
  remainder = remainder - (double)a1 * 10.0;
  a2 = (int)(remainder);
  //remainder = remainder - (double)a2;
  //a3 = (int)(24.0 * remainder);
  GadgetData.WSPRData.MaidenHead4[0] = (char)o1 + 'A';
  GadgetData.WSPRData.MaidenHead4[1] = (char)a1 + 'A';
  GadgetData.WSPRData.MaidenHead4[2] = (char)o2 + '0';
  GadgetData.WSPRData.MaidenHead4[3] = (char)a2 + '0';
  GadgetData.WSPRData.MaidenHead4[4] = 0;
}


//Delay loop that checks if the GPS serial port is sending data and in that case passes it of to the the GPS object
static void smartdelay(unsigned long delay_ms)
{
  // This custom version of delay() ensures that the gps object
  // is being "fed". Original code from the TinyGPS example but here used for the NeoGPS
  long TimeLeft;
  unsigned long EndTime = delay_ms + millis();

  do
  {
    while (gps.available( GPSSerial )) fix = gps.read(); //If GPS data available - process it
    TimeLeft = EndTime - millis();
    if ((TimeLeft > 3000)) {
      //Send API update 
      Serial.print (F("{MPS} "));
      Serial.println (TimeLeft / 1000);
      delay (1000);
    }
  } while ((TimeLeft > 0) && (!Serial.available())) ; //Until time is up or there is serial data received
  if (delay_ms > 1000) Serial.println (F("{MPS} 0"));//When pause is complete send Pause 0 to the GUI so it looks neater. But only if it was at least a one second delay 
}


uint8_t i2cStart()
{
  TWCR = (1 << TWINT) | (1 << TWSTA) | (1 << TWEN);

  while (!(TWCR & (1 << TWINT))) ;

  return (TWSR & 0xF8);
}

void i2cStop()
{
  TWCR = (1 << TWINT) | (1 << TWEN) | (1 << TWSTO);

